# GetDocument Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkNode..::..GetDocument Method
LinkNode Class See Also
---
Returns the document associated with the link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Document GetDocument()
```

Visual Basic
---
```text
Public Function GetDocument As Document
```

Visual C++
---
```text
public:
Document^ GetDocument()
```

# ### Return Value
Instance of a Document
# Remarks
The document is in read-only state. Transactions are not allowed in it.
# See Also
LinkNode Class
Autodesk.Revit.DB Namespace